loadtest/artillery.yaml
config:
  target: "http://localhost"
  phases:
    - duration: 60
      arrivalRate: 20   # 20 new VUs/sec
    - duration: 120
      arrivalRate: 50   # ramp to 50 rps
  processor: ./processors.js
  defaults:
    headers:
      Content-Type: application/json

scenarios:
  - name: Anonymous browse and auth pages
    flow:
      - get:
          url: "/app/dashboard"
      - get:
          url: "/api/health"
      - get:
          url: "/app/authentication/sign-in"
      - get:
          url: "/app/authentication/sign-up"
  - name: API burst (safe endpoints)
    flow:
      - get:
          url: "/api/health"
      - get:
          url: "/api/flask/api/hello"